CMD_EDIT = "ادت"
TRIGGER_BOT_KEYWORD = "بوت"

TXT_EDIT_PROMPT = "تستطيع تغيير وضع عمل البوت\nمن هنا"
TXT_ADMIN_ONLY = "عزيزي\nليس مصرح لك القيام بذلك"

TXT_START_DOWNLOAD = "ههع راح اموطلك وامص عيرك دادي\nيدلل نياشي"
TXT_DOWNLOAD_FAILED = "الرابط غير المدعوم او الموقع مو راضي يتعاون\nشم طيزي يلا"
TXT_TAKEOFF = "اشتغل البوت مرتلخ مولاي\nمواح"

BTN_NORMAL = "نورمال"
BTN_VOICE = "فويس"
BTN_DEVELOPER = "المطور"

ROTATING_MESSAGES = [
    "اهلين وسهلين\nاستاذ/ة",
    "وياك بوت ميديا دز رابط منشور\nالفيد وادزلكيا",
    "مو ناوي تستعملني مثل\nالبوتات ترى بس اضوج ينتفخ ديسي",
    "راح انزع وتنيكني بدال هذا\nالنيج شو داضوج"
]
