TAKEOFF_MESSAGE = (
    "اشتغل البوت مرتلخ مولاي\n"
    "مواح"
)

EDIT_TRIGGER = "ادت"

EDIT_MESSAGE = (
    "تستطيع تغيير وضع عمل البوت\n"
    "من هنا"
)

NORMAL_BUTTON = "نورمال"
VOICE_BUTTON = "فويس"
DEVELOPER_BUTTON = "المطور"

DOWNLOAD_STARTED = (
    "راح اموطلك وامص عيرك اوف\n"
    "يدلل نياشي ءمهمواح"
)

DOWNLOAD_FAILED = (
    "الرابط غير مدعوم او الموقع مو راضي يتعاون\n"
    "العق كسي يلا"
)

NORMAL_REPLIES = [
    "اهلين وسهلين\n"
    "استاذ/ة",

    "وياك بوت ميديا دز رابط منشور\n"
    "الفيد وادزلكيا",

    "مو ناوي تستعملني مثل\n"
    "البوتات ترى بس اضوج ينتفخ ديسي",

    "راح انزع وتنيكني بدال هذا\n"
    "النيج شو داضوج"
]