MODE_EDIT = "اديت"
BOT_WORD = "بوت"

MODE_VOICE = "فويس"
MODE_NORMAL = "نورمال"

MODE_TEXT = (
    "تستطيع تغيير وضع عمل البوت\n"
    "من هنا"
)

DEVELOPER_NAMES = (
    "المالك",
    "المطور",
    "المنشئ",
)

STARTUP_TEXT = (
    "اشتغل البوت مرتلخ\n"
    "تع امص"
)

DOWNLOAD_START_TEXT = (
    "تدلل دامص بعيرك مولاي\n"
    "اروح فدوا"
)

DOWNLOAD_FAIL_TEXT = (
    "الرابط غير مدعوم او الموقع مو راضي يتعاون\n"
    "العق عيري يلا"
)

UNAUTHORIZED_TEXT = (
    "ليس مسموح لك القيام\n"
    "بهذا التغيير"
)

ROTATING_REPLIES = (
    (
        "اهلين وسهلين\n"
        "استاذ/ة"
    ),
    (
        "مو ناوي تستعملني مثل البوتات ترى بس اضوج\n"
        "ينتفخ ديسي"
    ),
    (
        "ترى يمكن انطيك بلوك\n"
        "واعوفك ملبوس"
    ),
    (
        "راح انزع وتنيكني بدال هذا الاستنياج\n"
        "شو داضوج"
    ),
    (
        "ترى امص عيرك ماتنيكني وتضرط طيزي\n"
        "وتفوخ كسي"
    ),
)

REACTIONS = (
    "😭",
    "🥰",
    "❤️",
    "😘",
    "🤣",
)

REACTION_DELAYS = (
    2.4,
    4.2,
    4.8,
    3.6,
    3.9,
    2.2,
)

TYPE_DELAY = 0.3

TYPE_PATTERNS = (
    (2, 4),
    (3, 6),
)