TAKEOFF_MESSAGE = "اشتغل البوت مرتلخ مولاي\nمواح"

EDIT_TRIGGER = "ادت"
BOT_TRIGGER = "بوت"

ENABLE_TRIGGER = "تفعيل"
DISABLE_TRIGGER = "تعطيل"

ENABLE_REPLY = (
    "تم تفعيل البوت تستطيع ان تعطلني\n"
    "فيما بعد"
)

DISABLE_REPLY = (
    "تم تعطيل البوت تستطيع ان تفعلني\n"
    "فيما بعد"
)

EDIT_MESSAGE = "تستطيع تغيير وضع عمل البوت\nمن هنا"

UNAUTHORIZED = "عزيزي\nليس مصرح لك بذلك"

VOICE_BUTTON = "فويس"
VIRTUAL_BUTTON = "افتراضي"

AUTO_ENABLE_BUTTON = "تفعيل تلقائيا"

DOWNLOAD_STARTED = "ههع راح اموطلك وامص عيرك دادي\nيدلل نياشي"

DOWNLOAD_ERROR = "الرابط غير المدعوم او الموقع مو راضي يتعاون\nشم طيزي يلا"

VOICE_EDIT_TRIGGER = "تعديل"
AUDIO_EXTRACT_TRIGGER = "بدء"

VOICE_EDIT_INFO_BUTTON = "اطلاع"

VOICE_EDIT_START = (
    "اذا تريد تعدل مدة الفويس دوس ع\n"
    "الزر علمود تفتهم شلون"
)

VOICE_EDIT_INFO = (
    "24 36\n"
    "0:24 0:36\n"
    "ثوانِ\n"
    "\n"
    "1:23 2:34\n"
    "01:23 02:34\n"
    "دقائق\n"
    "\n"
    "1:23.40 2:34.50\n"
    "01:23.40 02:34.50\n"
    "دقائق + ميكرو ثانية\n"
    "\n"
    "8.30 10.20\n"
    "8.30:40 10.20:15\n"
    "ساعات\n"
    "\n"
    "8.30:40.25 10.20:15.50\n"
    "ساعات + ميكرو الثانية"
)

VOICE_EDIT_TOO_LONG = (
    "مدة هذه الصوتيه اصغر من المدة اللتي\n"
    "ارسلتها"
)

VOICE_EDIT_INVALID = (
    "غير مقبول\n"
    "الصيغه غير مدعومه"
)

NO_AUDIO_TRACK_ERROR = (
    "لا يمتلك هذا الفيديو او هذا الملف\n"
    "مسارا صوتيا"
)

AUTO_ENABLED_MESSAGE = (
    "تم تفعيل البوت تلقائيا\n"
    "بهذا الشات"
)

BOT_REPLIES = [
    "اهلين وسهلين\nاستاذ/ة",
    "وياك بوت ميديا دز رابط منشور\nالفيد وادزلكيا",
    "مو ناوي تستعملني مثل\nالبوتات ترى بس اضوج ينتفخ ديسي",
    "راح انزع وتنيكني بدال هذا\nالنيج شو داضوج"
]
