HELLO_WORD = """اهلين وسهلين
استاذ/ة"""

HELLO_WORD_2 = """مو ناوي تستعملني مثل البوتات ترى بس اضوج
ينتفخ ديسي"""

HELLO_WORD_3 = """ترى يمكن انطيك بلوك
واعوفك ملبوس"""

HELLO_WORD_4 = """راح انزع وتنيكني بدال هذا الاستنياج
شو داضوج"""

HELLO_WORD_5 = """ترى امص عيرك ماتنيكني وتضرط طيزي
وتفوخ كسي"""

DOWNLOAD_START = """تدلل دامص بعيرك مولاي
اروح فدوا"""

DOWNLOAD_FAIL = """الرابط غير مدعوم او الموقع مو راضي يتعاون
العق عيري يلا"""

STARTUP = """اشتغل البوت مرتلخ
تع امص"""

EDIT_WORD = "ادت"
BOT_WORD = "بوت"

VOICE_LABEL = "فويس"
NORMAL_LABEL = "نورمال"

EDIT_TEXT = """تستطيع تغيير وضع عمل البوت
من هنا"""

UNAUTHORIZED_EDIT = """ليس مسموح لك القيام
بهذا التغيير"""

REPLIES = (
    HELLO_WORD,
    HELLO_WORD_2,
    HELLO_WORD_3,
    HELLO_WORD_4,
    HELLO_WORD_5,
)