CMD_EDIT = "ادت"
CMD_BOT = "بوت"

USER_BOT_RESPONSES = [
    "اهلين وسهلين\nاستاذ/ة",
    "مو ناوي تستعملني مثل البوتات ترى بس اضوج\nينتفخ ديسي",
    "ترى يمكن انطيك بلوك\nواعوفك ملبوس",
    "راح انزع وتنيكني بدال هذا الاستنياج\nشو داضوج",
    "ترى امص عيرك ماتنيكني وتضرط طيزي\nوتفوخ كسي"
]

TXT_EDIT_MENU = "تستطيع تغيير وضع عمل البوت\nمن هنا"
TXT_NOT_ALLOWED = "ليس مسموح لك القيام\nبهذا التغيير"
TXT_TAKEOFF = "اشتغل البوت مرتلخ\nتع امص"
TXT_START_DOWNLOAD = "تدلل دامص بعيرك مولاي\nاروح فدوا"
TXT_DOWNLOAD_FAILED = "الرابط غير مدعوم او الموقع مو راضي يتعاون\nالعق عيري يلا"

BTN_VOICE_LABEL = "فويس"
BTN_NORMAL_LABEL = "نورمال"

DEV_BUTTON_NAMES = ["المالك", "المطور", "المنشئ"]

REACTION_EMOJIS = ['😭', '🥰', '❤️', '😘', '🤣']
REACTION_DELAYS = [2.4, 4.2, 4.8, 3.6, 3.9, 2.2]
